susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32L071.h
/*
 * This file is automatically generated by afTable.py from the xml descriptions provided as part of the STM32Cube IDE
 * Timestamp: 2022-12-19T23:52:17.201035
 */

#ifndef LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION
#define LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION

#define COMP1_OUT_PA0_ PA0,GPIO_AF7
#define COMP1_OUT_PA11_ PA11,GPIO_AF7
#define COMP1_OUT_PA6_ PA6,GPIO_AF7
#define _COMP1_OUT_PA0_ 1
#define _COMP1_OUT_PA11_ 1
#define _COMP1_OUT_PA6_ 1

#define COMP2_OUT_PA12_ PA12,GPIO_AF7
#define COMP2_OUT_PA2_ PA2,GPIO_AF7
#define COMP2_OUT_PA7_ PA7,GPIO_AF7
#define _COMP2_OUT_PA12_ 1
#define _COMP2_OUT_PA2_ 1
#define _COMP2_OUT_PA7_ 1

#define CRS_SYNC_PA8_ PA8,GPIO_AF2
#define CRS_SYNC_PD15_ PD15,GPIO_AF0
#define CRS_SYNC_PH0_ PH0,GPIO_AF0
#define _CRS_SYNC_PA8_ 1
#define _CRS_SYNC_PD15_ 1
#define _CRS_SYNC_PH0_ 1

#define EVENTOUT_PA1_ PA1,GPIO_AF0
#define EVENTOUT_PA11_ PA11,GPIO_AF2
#define EVENTOUT_PA12_ PA12,GPIO_AF2
#define EVENTOUT_PA15_ PA15,GPIO_AF3
#define EVENTOUT_PA6_ PA6,GPIO_AF6
#define EVENTOUT_PA7_ PA7,GPIO_AF6
#define EVENTOUT_PA8_ PA8,GPIO_AF3
#define EVENTOUT_PB0_ PB0,GPIO_AF0
#define EVENTOUT_PB11_ PB11,GPIO_AF0
#define EVENTOUT_PB12_ PB12,GPIO_AF6
#define EVENTOUT_PB3_ PB3,GPIO_AF4
#define EVENTOUT_PB9_ PB9,GPIO_AF2
#define EVENTOUT_PC0_ PC0,GPIO_AF2
#define EVENTOUT_PC1_ PC1,GPIO_AF2
#define EVENTOUT_PC4_ PC4,GPIO_AF0
#define EVENTOUT_PE0_ PE0,GPIO_AF2
#define EVENTOUT_PE1_ PE1,GPIO_AF2
#define _EVENTOUT_PA1_ 1
#define _EVENTOUT_PA11_ 1
#define _EVENTOUT_PA12_ 1
#define _EVENTOUT_PA15_ 1
#define _EVENTOUT_PA6_ 1
#define _EVENTOUT_PA7_ 1
#define _EVENTOUT_PA8_ 1
#define _EVENTOUT_PB0_ 1
#define _EVENTOUT_PB11_ 1
#define _EVENTOUT_PB12_ 1
#define _EVENTOUT_PB3_ 1
#define _EVENTOUT_PB9_ 1
#define _EVENTOUT_PC0_ 1
#define _EVENTOUT_PC1_ 1
#define _EVENTOUT_PC4_ 1
#define _EVENTOUT_PE0_ 1
#define _EVENTOUT_PE1_ 1

#define I2C1_SCL_PA9_ PA9,GPIO_AF6
#define I2C1_SCL_PB6_ PB6,GPIO_AF1
#define I2C1_SCL_PB8_ PB8,GPIO_AF4
#define _I2C1_SCL_PA9_ 1
#define _I2C1_SCL_PB6_ 1
#define _I2C1_SCL_PB8_ 1

#define I2C1_SDA_PA10_ PA10,GPIO_AF6
#define I2C1_SDA_PB7_ PB7,GPIO_AF1
#define I2C1_SDA_PB9_ PB9,GPIO_AF4
#define _I2C1_SDA_PA10_ 1
#define _I2C1_SDA_PB7_ 1
#define _I2C1_SDA_PB9_ 1

#define I2C1_SMBA_PB5_ PB5,GPIO_AF3
#define _I2C1_SMBA_PB5_ 1

#define I2C2_SCL_PB10_ PB10,GPIO_AF6
#define I2C2_SCL_PB13_ PB13,GPIO_AF5
#define _I2C2_SCL_PB10_ 1
#define _I2C2_SCL_PB13_ 1

#define I2C2_SDA_PB11_ PB11,GPIO_AF6
#define I2C2_SDA_PB14_ PB14,GPIO_AF5
#define _I2C2_SDA_PB11_ 1
#define _I2C2_SDA_PB14_ 1

#define I2C2_SMBA_PB12_ PB12,GPIO_AF5
#define _I2C2_SMBA_PB12_ 1

#define I2C3_SCL_PA8_ PA8,GPIO_AF7
#define I2C3_SCL_PC0_ PC0,GPIO_AF7
#define _I2C3_SCL_PA8_ 1
#define _I2C3_SCL_PC0_ 1

#define I2C3_SDA_PB4_ PB4,GPIO_AF7
#define I2C3_SDA_PC1_ PC1,GPIO_AF7
#define I2C3_SDA_PC9_ PC9,GPIO_AF7
#define _I2C3_SDA_PB4_ 1
#define _I2C3_SDA_PC1_ 1
#define _I2C3_SDA_PC9_ 1

#define I2C3_SMBA_PA9_ PA9,GPIO_AF7
#define I2C3_SMBA_PB2_ PB2,GPIO_AF7
#define _I2C3_SMBA_PA9_ 1
#define _I2C3_SMBA_PB2_ 1

#define I2S2_CK_PB13_ PB13,GPIO_AF0
#define I2S2_CK_PD1_ PD1,GPIO_AF1
#define _I2S2_CK_PB13_ 1
#define _I2S2_CK_PD1_ 1

#define I2S2_MCK_PB14_ PB14,GPIO_AF0
#define I2S2_MCK_PC2_ PC2,GPIO_AF2
#define I2S2_MCK_PD3_ PD3,GPIO_AF2
#define _I2S2_MCK_PB14_ 1
#define _I2S2_MCK_PC2_ 1
#define _I2S2_MCK_PD3_ 1

#define I2S2_SD_PB15_ PB15,GPIO_AF0
#define I2S2_SD_PC3_ PC3,GPIO_AF2
#define I2S2_SD_PD4_ PD4,GPIO_AF1
#define _I2S2_SD_PB15_ 1
#define _I2S2_SD_PC3_ 1
#define _I2S2_SD_PD4_ 1

#define I2S2_WS_PB12_ PB12,GPIO_AF0
#define I2S2_WS_PB9_ PB9,GPIO_AF5
#define I2S2_WS_PD0_ PD0,GPIO_AF1
#define _I2S2_WS_PB12_ 1
#define _I2S2_WS_PB9_ 1
#define _I2S2_WS_PD0_ 1

#define LCD_COM0_PA8_ PA8,GPIO_AF1
#define _LCD_COM0_PA8_ 1

#define LCD_COM1_PA9_ PA9,GPIO_AF1
#define _LCD_COM1_PA9_ 1

#define LCD_COM2_PA10_ PA10,GPIO_AF1
#define _LCD_COM2_PA10_ 1

#define LCD_COM3_PB9_ PB9,GPIO_AF1
#define _LCD_COM3_PB9_ 1

#define LCD_COM4_PC10_ PC10,GPIO_AF1
#define _LCD_COM4_PC10_ 1

#define LCD_COM5_PC11_ PC11,GPIO_AF1
#define _LCD_COM5_PC11_ 1

#define LCD_COM6_PC12_ PC12,GPIO_AF1
#define _LCD_COM6_PC12_ 1

#define LCD_COM7_PD2_ PD2,GPIO_AF1
#define _LCD_COM7_PD2_ 1

#define LCD_SEG0_PA1_ PA1,GPIO_AF1
#define _LCD_SEG0_PA1_ 1

#define LCD_SEG1_PA2_ PA2,GPIO_AF1
#define _LCD_SEG1_PA2_ 1

#define LCD_SEG10_PB10_ PB10,GPIO_AF1
#define _LCD_SEG10_PB10_ 1

#define LCD_SEG11_PB11_ PB11,GPIO_AF1
#define _LCD_SEG11_PB11_ 1

#define LCD_SEG12_PB12_ PB12,GPIO_AF1
#define _LCD_SEG12_PB12_ 1

#define LCD_SEG13_PB13_ PB13,GPIO_AF1
#define _LCD_SEG13_PB13_ 1

#define LCD_SEG14_PB14_ PB14,GPIO_AF1
#define _LCD_SEG14_PB14_ 1

#define LCD_SEG15_PB15_ PB15,GPIO_AF1
#define _LCD_SEG15_PB15_ 1

#define LCD_SEG16_PB8_ PB8,GPIO_AF1
#define _LCD_SEG16_PB8_ 1

#define LCD_SEG17_PA15_ PA15,GPIO_AF1
#define _LCD_SEG17_PA15_ 1

#define LCD_SEG18_PC0_ PC0,GPIO_AF1
#define _LCD_SEG18_PC0_ 1

#define LCD_SEG19_PC1_ PC1,GPIO_AF1
#define _LCD_SEG19_PC1_ 1

#define LCD_SEG2_PA3_ PA3,GPIO_AF1
#define _LCD_SEG2_PA3_ 1

#define LCD_SEG20_PC2_ PC2,GPIO_AF1
#define _LCD_SEG20_PC2_ 1

#define LCD_SEG21_PC3_ PC3,GPIO_AF1
#define _LCD_SEG21_PC3_ 1

#define LCD_SEG22_PC4_ PC4,GPIO_AF1
#define _LCD_SEG22_PC4_ 1

#define LCD_SEG23_PC5_ PC5,GPIO_AF1
#define _LCD_SEG23_PC5_ 1

#define LCD_SEG24_PC6_ PC6,GPIO_AF1
#define _LCD_SEG24_PC6_ 1

#define LCD_SEG25_PC7_ PC7,GPIO_AF1
#define _LCD_SEG25_PC7_ 1

#define LCD_SEG26_PC8_ PC8,GPIO_AF1
#define _LCD_SEG26_PC8_ 1

#define LCD_SEG27_PC9_ PC9,GPIO_AF1
#define _LCD_SEG27_PC9_ 1

#define LCD_SEG28_PC10_ PC10,GPIO_AF1
#define LCD_SEG28_PD8_ PD8,GPIO_AF1
#define _LCD_SEG28_PC10_ 1
#define _LCD_SEG28_PD8_ 1

#define LCD_SEG29_PC11_ PC11,GPIO_AF1
#define LCD_SEG29_PD9_ PD9,GPIO_AF1
#define _LCD_SEG29_PC11_ 1
#define _LCD_SEG29_PD9_ 1

#define LCD_SEG3_PA6_ PA6,GPIO_AF1
#define _LCD_SEG3_PA6_ 1

#define LCD_SEG30_PC12_ PC12,GPIO_AF1
#define LCD_SEG30_PD10_ PD10,GPIO_AF1
#define _LCD_SEG30_PC12_ 1
#define _LCD_SEG30_PD10_ 1

#define LCD_SEG31_PD11_ PD11,GPIO_AF1
#define LCD_SEG31_PD2_ PD2,GPIO_AF1
#define _LCD_SEG31_PD11_ 1
#define _LCD_SEG31_PD2_ 1

#define LCD_SEG32_PD12_ PD12,GPIO_AF1
#define _LCD_SEG32_PD12_ 1

