susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32L071.h
#define LCD_SEG33_PD13_ PD13,GPIO_AF1
#define _LCD_SEG33_PD13_ 1

#define LCD_SEG34_PD14_ PD14,GPIO_AF1
#define _LCD_SEG34_PD14_ 1

#define LCD_SEG35_PD15_ PD15,GPIO_AF1
#define _LCD_SEG35_PD15_ 1

#define LCD_SEG36_PE0_ PE0,GPIO_AF1
#define _LCD_SEG36_PE0_ 1

#define LCD_SEG37_PE1_ PE1,GPIO_AF1
#define _LCD_SEG37_PE1_ 1

#define LCD_SEG38_PE2_ PE2,GPIO_AF1
#define _LCD_SEG38_PE2_ 1

#define LCD_SEG39_PE3_ PE3,GPIO_AF1
#define _LCD_SEG39_PE3_ 1

#define LCD_SEG4_PA7_ PA7,GPIO_AF1
#define _LCD_SEG4_PA7_ 1

#define LCD_SEG40_PE10_ PE10,GPIO_AF1
#define _LCD_SEG40_PE10_ 1

#define LCD_SEG41_PE13_ PE13,GPIO_AF1
#define _LCD_SEG41_PE13_ 1

#define LCD_SEG42_PE14_ PE14,GPIO_AF1
#define _LCD_SEG42_PE14_ 1

#define LCD_SEG43_PE15_ PE15,GPIO_AF1
#define _LCD_SEG43_PE15_ 1

#define LCD_SEG44_PD3_ PD3,GPIO_AF1
#define _LCD_SEG44_PD3_ 1

#define LCD_SEG45_PE7_ PE7,GPIO_AF1
#define _LCD_SEG45_PE7_ 1

#define LCD_SEG46_PE8_ PE8,GPIO_AF1
#define _LCD_SEG46_PE8_ 1

#define LCD_SEG47_PE9_ PE9,GPIO_AF1
#define _LCD_SEG47_PE9_ 1

#define LCD_SEG48_PC10_ PC10,GPIO_AF1
#define _LCD_SEG48_PC10_ 1

#define LCD_SEG49_PC11_ PC11,GPIO_AF1
#define _LCD_SEG49_PC11_ 1

#define LCD_SEG5_PB0_ PB0,GPIO_AF1
#define _LCD_SEG5_PB0_ 1

#define LCD_SEG50_PC12_ PC12,GPIO_AF1
#define _LCD_SEG50_PC12_ 1

#define LCD_SEG51_PD2_ PD2,GPIO_AF1
#define _LCD_SEG51_PD2_ 1

#define LCD_SEG6_PB1_ PB1,GPIO_AF1
#define _LCD_SEG6_PB1_ 1

#define LCD_SEG7_PB3_ PB3,GPIO_AF1
#define _LCD_SEG7_PB3_ 1

#define LCD_SEG8_PB4_ PB4,GPIO_AF1
#define _LCD_SEG8_PB4_ 1

#define LCD_SEG9_PB5_ PB5,GPIO_AF1
#define _LCD_SEG9_PB5_ 1

#define LPTIM1_ETR_PB6_ PB6,GPIO_AF2
#define LPTIM1_ETR_PC3_ PC3,GPIO_AF0
#define _LPTIM1_ETR_PB6_ 1
#define _LPTIM1_ETR_PC3_ 1

#define LPTIM1_IN1_PB5_ PB5,GPIO_AF2
#define LPTIM1_IN1_PC0_ PC0,GPIO_AF0
#define _LPTIM1_IN1_PB5_ 1
#define _LPTIM1_IN1_PC0_ 1

#define LPTIM1_IN2_PB7_ PB7,GPIO_AF2
#define LPTIM1_IN2_PC2_ PC2,GPIO_AF0
#define _LPTIM1_IN2_PB7_ 1
#define _LPTIM1_IN2_PC2_ 1

#define LPTIM1_OUT_PB2_ PB2,GPIO_AF2
#define LPTIM1_OUT_PC1_ PC1,GPIO_AF0
#define _LPTIM1_OUT_PB2_ 1
#define _LPTIM1_OUT_PC1_ 1

#define LPUART1_CTS_PA6_ PA6,GPIO_AF4
#define LPUART1_CTS_PB13_ PB13,GPIO_AF4
#define LPUART1_CTS_PD11_ PD11,GPIO_AF0
#define _LPUART1_CTS_PA6_ 1
#define _LPUART1_CTS_PB13_ 1
#define _LPUART1_CTS_PD11_ 1

#define LPUART1_DE_PB1_ PB1,GPIO_AF4
#define LPUART1_DE_PB12_ PB12,GPIO_AF2
#define LPUART1_DE_PB14_ PB14,GPIO_AF4
#define LPUART1_DE_PD12_ PD12,GPIO_AF0
#define LPUART1_DE_PD2_ PD2,GPIO_AF0
#define _LPUART1_DE_PB1_ 1
#define _LPUART1_DE_PB12_ 1
#define _LPUART1_DE_PB14_ 1
#define _LPUART1_DE_PD12_ 1
#define _LPUART1_DE_PD2_ 1

#define LPUART1_RTS_PB1_ PB1,GPIO_AF4
#define LPUART1_RTS_PB12_ PB12,GPIO_AF2
#define LPUART1_RTS_PB14_ PB14,GPIO_AF4
#define LPUART1_RTS_PD12_ PD12,GPIO_AF0
#define LPUART1_RTS_PD2_ PD2,GPIO_AF0
#define _LPUART1_RTS_PB1_ 1
#define _LPUART1_RTS_PB12_ 1
#define _LPUART1_RTS_PB14_ 1
#define _LPUART1_RTS_PD12_ 1
#define _LPUART1_RTS_PD2_ 1

#define LPUART1_RX_PA13_ PA13,GPIO_AF6
#define LPUART1_RX_PA3_ PA3,GPIO_AF6
#define LPUART1_RX_PB10_ PB10,GPIO_AF7
#define LPUART1_RX_PB11_ PB11,GPIO_AF4
#define LPUART1_RX_PC0_ PC0,GPIO_AF6
#define LPUART1_RX_PC11_ PC11,GPIO_AF0
#define LPUART1_RX_PC5_ PC5,GPIO_AF2
#define LPUART1_RX_PD9_ PD9,GPIO_AF0
#define _LPUART1_RX_PA13_ 1
#define _LPUART1_RX_PA3_ 1
#define _LPUART1_RX_PB10_ 1
#define _LPUART1_RX_PB11_ 1
#define _LPUART1_RX_PC0_ 1
#define _LPUART1_RX_PC11_ 1
#define _LPUART1_RX_PC5_ 1
#define _LPUART1_RX_PD9_ 1

#define LPUART1_TX_PA14_ PA14,GPIO_AF6
#define LPUART1_TX_PA2_ PA2,GPIO_AF6
#define LPUART1_TX_PB10_ PB10,GPIO_AF4
#define LPUART1_TX_PB11_ PB11,GPIO_AF7
#define LPUART1_TX_PC1_ PC1,GPIO_AF6
#define LPUART1_TX_PC10_ PC10,GPIO_AF0
#define LPUART1_TX_PC4_ PC4,GPIO_AF2
#define LPUART1_TX_PD8_ PD8,GPIO_AF0
#define _LPUART1_TX_PA14_ 1
#define _LPUART1_TX_PA2_ 1
#define _LPUART1_TX_PB10_ 1
#define _LPUART1_TX_PB11_ 1
#define _LPUART1_TX_PC1_ 1
#define _LPUART1_TX_PC10_ 1
#define _LPUART1_TX_PC4_ 1
#define _LPUART1_TX_PD8_ 1

#define RCC_MCO_PA8_ PA8,GPIO_AF0
#define RCC_MCO_PA9_ PA9,GPIO_AF0
#define RCC_MCO_PB13_ PB13,GPIO_AF2
#define _RCC_MCO_PA8_ 1
#define _RCC_MCO_PA9_ 1
#define _RCC_MCO_PB13_ 1

#define RTC_OUT_ALARM_PB14_ PB14,GPIO_AF2
#define _RTC_OUT_ALARM_PB14_ 1

#define RTC_OUT_CALIB_PB14_ PB14,GPIO_AF2
#define _RTC_OUT_CALIB_PB14_ 1

#define RTC_REFIN_PB15_ PB15,GPIO_AF2
#define _RTC_REFIN_PB15_ 1

#define SPI1_MISO_PA11_ PA11,GPIO_AF0
#define SPI1_MISO_PA6_ PA6,GPIO_AF0
#define SPI1_MISO_PB4_ PB4,GPIO_AF0
#define SPI1_MISO_PE14_ PE14,GPIO_AF2
#define _SPI1_MISO_PA11_ 1
#define _SPI1_MISO_PA6_ 1
#define _SPI1_MISO_PB4_ 1
#define _SPI1_MISO_PE14_ 1

#define SPI1_MOSI_PA12_ PA12,GPIO_AF0
#define SPI1_MOSI_PA7_ PA7,GPIO_AF0
#define SPI1_MOSI_PB5_ PB5,GPIO_AF0
#define SPI1_MOSI_PE15_ PE15,GPIO_AF2
#define _SPI1_MOSI_PA12_ 1
#define _SPI1_MOSI_PA7_ 1
#define _SPI1_MOSI_PB5_ 1
#define _SPI1_MOSI_PE15_ 1

#define SPI1_NSS_PA15_ PA15,GPIO_AF0
#define SPI1_NSS_PA4_ PA4,GPIO_AF0
#define SPI1_NSS_PE12_ PE12,GPIO_AF2
#define _SPI1_NSS_PA15_ 1
#define _SPI1_NSS_PA4_ 1
#define _SPI1_NSS_PE12_ 1

#define SPI1_SCK_PA5_ PA5,GPIO_AF0
#define SPI1_SCK_PB3_ PB3,GPIO_AF0
#define SPI1_SCK_PE13_ PE13,GPIO_AF2
#define _SPI1_SCK_PA5_ 1
#define _SPI1_SCK_PB3_ 1
#define _SPI1_SCK_PE13_ 1

#define SPI2_MISO_PB14_ PB14,GPIO_AF0
#define SPI2_MISO_PC2_ PC2,GPIO_AF2
#define SPI2_MISO_PD3_ PD3,GPIO_AF2
#define _SPI2_MISO_PB14_ 1
#define _SPI2_MISO_PC2_ 1
#define _SPI2_MISO_PD3_ 1

#define SPI2_MOSI_PB15_ PB15,GPIO_AF0
#define SPI2_MOSI_PC3_ PC3,GPIO_AF2
#define SPI2_MOSI_PD4_ PD4,GPIO_AF1
#define _SPI2_MOSI_PB15_ 1
#define _SPI2_MOSI_PC3_ 1
#define _SPI2_MOSI_PD4_ 1

#define SPI2_NSS_PB12_ PB12,GPIO_AF0
#define SPI2_NSS_PB9_ PB9,GPIO_AF5
#define SPI2_NSS_PD0_ PD0,GPIO_AF1
#define _SPI2_NSS_PB12_ 1
#define _SPI2_NSS_PB9_ 1
#define _SPI2_NSS_PD0_ 1

#define SPI2_SCK_PB10_ PB10,GPIO_AF5
#define SPI2_SCK_PB13_ PB13,GPIO_AF0
#define SPI2_SCK_PD1_ PD1,GPIO_AF1
#define _SPI2_SCK_PB10_ 1
#define _SPI2_SCK_PB13_ 1
#define _SPI2_SCK_PD1_ 1

#define SYS_SWCLK_PA14_ PA14,GPIO_AF0
#define _SYS_SWCLK_PA14_ 1

