susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32L071.h
#define SYS_SWDIO_PA13_ PA13,GPIO_AF0
#define _SYS_SWDIO_PA13_ 1

#define TIM21_CH1_PA2_ PA2,GPIO_AF0
#define TIM21_CH1_PB13_ PB13,GPIO_AF6
#define TIM21_CH1_PD0_ PD0,GPIO_AF0
#define TIM21_CH1_PE5_ PE5,GPIO_AF0
#define _TIM21_CH1_PA2_ 1
#define _TIM21_CH1_PB13_ 1
#define _TIM21_CH1_PD0_ 1
#define _TIM21_CH1_PE5_ 1

#define TIM21_CH2_PA3_ PA3,GPIO_AF0
#define TIM21_CH2_PB14_ PB14,GPIO_AF6
#define TIM21_CH2_PD7_ PD7,GPIO_AF1
#define TIM21_CH2_PE6_ PE6,GPIO_AF0
#define _TIM21_CH2_PA3_ 1
#define _TIM21_CH2_PB14_ 1
#define _TIM21_CH2_PD7_ 1
#define _TIM21_CH2_PE6_ 1

#define TIM21_ETR_PA1_ PA1,GPIO_AF5
#define TIM21_ETR_PC9_ PC9,GPIO_AF0
#define _TIM21_ETR_PA1_ 1
#define _TIM21_ETR_PC9_ 1

#define TIM22_CH1_PA6_ PA6,GPIO_AF5
#define TIM22_CH1_PB4_ PB4,GPIO_AF4
#define TIM22_CH1_PC6_ PC6,GPIO_AF0
#define TIM22_CH1_PE3_ PE3,GPIO_AF0
#define _TIM22_CH1_PA6_ 1
#define _TIM22_CH1_PB4_ 1
#define _TIM22_CH1_PC6_ 1
#define _TIM22_CH1_PE3_ 1

#define TIM22_CH2_PA7_ PA7,GPIO_AF5
#define TIM22_CH2_PB5_ PB5,GPIO_AF4
#define TIM22_CH2_PC7_ PC7,GPIO_AF0
#define TIM22_CH2_PE4_ PE4,GPIO_AF0
#define _TIM22_CH2_PA7_ 1
#define _TIM22_CH2_PB5_ 1
#define _TIM22_CH2_PC7_ 1
#define _TIM22_CH2_PE4_ 1

#define TIM22_ETR_PA4_ PA4,GPIO_AF5
#define TIM22_ETR_PC8_ PC8,GPIO_AF0
#define _TIM22_ETR_PA4_ 1
#define _TIM22_ETR_PC8_ 1

#define TIM2_CH1_PA0_ PA0,GPIO_AF2
#define TIM2_CH1_PA15_ PA15,GPIO_AF5
#define TIM2_CH1_PA5_ PA5,GPIO_AF5
#define TIM2_CH1_PE9_ PE9,GPIO_AF0
#define _TIM2_CH1_PA0_ 1
#define _TIM2_CH1_PA15_ 1
#define _TIM2_CH1_PA5_ 1
#define _TIM2_CH1_PE9_ 1

#define TIM2_CH2_PA1_ PA1,GPIO_AF2
#define TIM2_CH2_PB3_ PB3,GPIO_AF2
#define TIM2_CH2_PE10_ PE10,GPIO_AF0
#define _TIM2_CH2_PA1_ 1
#define _TIM2_CH2_PB3_ 1
#define _TIM2_CH2_PE10_ 1

#define TIM2_CH3_PA2_ PA2,GPIO_AF2
#define TIM2_CH3_PB10_ PB10,GPIO_AF2
#define TIM2_CH3_PE11_ PE11,GPIO_AF0
#define _TIM2_CH3_PA2_ 1
#define _TIM2_CH3_PB10_ 1
#define _TIM2_CH3_PE11_ 1

#define TIM2_CH4_PA3_ PA3,GPIO_AF2
#define TIM2_CH4_PB11_ PB11,GPIO_AF2
#define TIM2_CH4_PE12_ PE12,GPIO_AF0
#define _TIM2_CH4_PA3_ 1
#define _TIM2_CH4_PB11_ 1
#define _TIM2_CH4_PE12_ 1

#define TIM2_ETR_PA0_ PA0,GPIO_AF5
#define TIM2_ETR_PA15_ PA15,GPIO_AF2
#define TIM2_ETR_PA5_ PA5,GPIO_AF2
#define TIM2_ETR_PE9_ PE9,GPIO_AF2
#define _TIM2_ETR_PA0_ 1
#define _TIM2_ETR_PA15_ 1
#define _TIM2_ETR_PA5_ 1
#define _TIM2_ETR_PE9_ 1

#define TIM3_CH1_PA6_ PA6,GPIO_AF2
#define TIM3_CH1_PB4_ PB4,GPIO_AF2
#define TIM3_CH1_PC6_ PC6,GPIO_AF2
#define TIM3_CH1_PE3_ PE3,GPIO_AF2
#define _TIM3_CH1_PA6_ 1
#define _TIM3_CH1_PB4_ 1
#define _TIM3_CH1_PC6_ 1
#define _TIM3_CH1_PE3_ 1

#define TIM3_CH2_PA7_ PA7,GPIO_AF2
#define TIM3_CH2_PB5_ PB5,GPIO_AF4
#define TIM3_CH2_PC7_ PC7,GPIO_AF2
#define TIM3_CH2_PE4_ PE4,GPIO_AF2
#define _TIM3_CH2_PA7_ 1
#define _TIM3_CH2_PB5_ 1
#define _TIM3_CH2_PC7_ 1
#define _TIM3_CH2_PE4_ 1

#define TIM3_CH3_PB0_ PB0,GPIO_AF2
#define TIM3_CH3_PC8_ PC8,GPIO_AF2
#define TIM3_CH3_PE5_ PE5,GPIO_AF2
#define _TIM3_CH3_PB0_ 1
#define _TIM3_CH3_PC8_ 1
#define _TIM3_CH3_PE5_ 1

#define TIM3_CH4_PB1_ PB1,GPIO_AF2
#define TIM3_CH4_PC9_ PC9,GPIO_AF2
#define TIM3_CH4_PE6_ PE6,GPIO_AF2
#define _TIM3_CH4_PB1_ 1
#define _TIM3_CH4_PC9_ 1
#define _TIM3_CH4_PE6_ 1

#define TIM3_ETR_PD2_ PD2,GPIO_AF2
#define TIM3_ETR_PE2_ PE2,GPIO_AF2
#define _TIM3_ETR_PD2_ 1
#define _TIM3_ETR_PE2_ 1

#define TSC_G1_IO1_PA0_ PA0,GPIO_AF3
#define _TSC_G1_IO1_PA0_ 1

#define TSC_G1_IO2_PA1_ PA1,GPIO_AF3
#define _TSC_G1_IO2_PA1_ 1

#define TSC_G1_IO3_PA2_ PA2,GPIO_AF3
#define _TSC_G1_IO3_PA2_ 1

#define TSC_G1_IO4_PA3_ PA3,GPIO_AF3
#define _TSC_G1_IO4_PA3_ 1

#define TSC_G2_IO1_PA4_ PA4,GPIO_AF3
#define _TSC_G2_IO1_PA4_ 1

#define TSC_G2_IO2_PA5_ PA5,GPIO_AF3
#define _TSC_G2_IO2_PA5_ 1

#define TSC_G2_IO3_PA6_ PA6,GPIO_AF3
#define _TSC_G2_IO3_PA6_ 1

#define TSC_G2_IO4_PA7_ PA7,GPIO_AF3
#define _TSC_G2_IO4_PA7_ 1

#define TSC_G3_IO1_PC5_ PC5,GPIO_AF3
#define _TSC_G3_IO1_PC5_ 1

#define TSC_G3_IO2_PB0_ PB0,GPIO_AF3
#define _TSC_G3_IO2_PB0_ 1

#define TSC_G3_IO3_PB1_ PB1,GPIO_AF3
#define _TSC_G3_IO3_PB1_ 1

#define TSC_G3_IO4_PB2_ PB2,GPIO_AF3
#define _TSC_G3_IO4_PB2_ 1

#define TSC_G4_IO1_PA9_ PA9,GPIO_AF3
#define _TSC_G4_IO1_PA9_ 1

#define TSC_G4_IO2_PA10_ PA10,GPIO_AF3
#define _TSC_G4_IO2_PA10_ 1

#define TSC_G4_IO3_PA11_ PA11,GPIO_AF3
#define _TSC_G4_IO3_PA11_ 1

#define TSC_G4_IO4_PA12_ PA12,GPIO_AF3
#define _TSC_G4_IO4_PA12_ 1

#define TSC_G5_IO1_PB3_ PB3,GPIO_AF3
#define _TSC_G5_IO1_PB3_ 1

#define TSC_G5_IO2_PB4_ PB4,GPIO_AF3
#define _TSC_G5_IO2_PB4_ 1

#define TSC_G5_IO3_PB6_ PB6,GPIO_AF3
#define _TSC_G5_IO3_PB6_ 1

#define TSC_G5_IO4_PB7_ PB7,GPIO_AF3
#define _TSC_G5_IO4_PB7_ 1

#define TSC_G6_IO1_PB11_ PB11,GPIO_AF3
#define _TSC_G6_IO1_PB11_ 1

#define TSC_G6_IO2_PB12_ PB12,GPIO_AF3
#define _TSC_G6_IO2_PB12_ 1

#define TSC_G6_IO3_PB13_ PB13,GPIO_AF3
#define _TSC_G6_IO3_PB13_ 1

#define TSC_G6_IO4_PB14_ PB14,GPIO_AF3
#define _TSC_G6_IO4_PB14_ 1

#define TSC_G7_IO1_PC0_ PC0,GPIO_AF3
#define _TSC_G7_IO1_PC0_ 1

#define TSC_G7_IO2_PC1_ PC1,GPIO_AF3
#define _TSC_G7_IO2_PC1_ 1

#define TSC_G7_IO3_PC2_ PC2,GPIO_AF3
#define _TSC_G7_IO3_PC2_ 1

#define TSC_G7_IO4_PC3_ PC3,GPIO_AF3
#define _TSC_G7_IO4_PC3_ 1

#define TSC_G8_IO1_PC6_ PC6,GPIO_AF3
#define _TSC_G8_IO1_PC6_ 1

#define TSC_G8_IO2_PC7_ PC7,GPIO_AF3
#define _TSC_G8_IO2_PC7_ 1

#define TSC_G8_IO3_PC8_ PC8,GPIO_AF3
#define _TSC_G8_IO3_PC8_ 1

#define TSC_G8_IO4_PC9_ PC9,GPIO_AF3
#define _TSC_G8_IO4_PC9_ 1

#define TSC_SYNC_PB10_ PB10,GPIO_AF3
#define TSC_SYNC_PB8_ PB8,GPIO_AF3
#define _TSC_SYNC_PB10_ 1
#define _TSC_SYNC_PB8_ 1

#define UART1_CK_PA8_ PA8,GPIO_AF4
#define UART1_CK_PB5_ PB5,GPIO_AF5
#define _UART1_CK_PA8_ 1
#define _UART1_CK_PB5_ 1

#define UART1_CTS_PA11_ PA11,GPIO_AF4
#define UART1_CTS_PB4_ PB4,GPIO_AF5
#define _UART1_CTS_PA11_ 1
#define _UART1_CTS_PB4_ 1

#define UART1_DE_PA12_ PA12,GPIO_AF4
#define UART1_DE_PB3_ PB3,GPIO_AF5
#define _UART1_DE_PA12_ 1
#define _UART1_DE_PB3_ 1

#define UART1_RTS_PA12_ PA12,GPIO_AF4
#define UART1_RTS_PB3_ PB3,GPIO_AF5
#define _UART1_RTS_PA12_ 1
#define _UART1_RTS_PB3_ 1

#define UART1_RX_PA10_ PA10,GPIO_AF4
#define UART1_RX_PB7_ PB7,GPIO_AF0
#define _UART1_RX_PA10_ 1
#define _UART1_RX_PB7_ 1

#define UART1_TX_PA9_ PA9,GPIO_AF4
#define UART1_TX_PB6_ PB6,GPIO_AF0
#define _UART1_TX_PA9_ 1
#define _UART1_TX_PB6_ 1

